package homework.task16;


//Առաջին տնայինը իրանից ներկայացնումա Ձեր կողմից արդեն իսկ իմացված հարթաչափության մեջ երկրաչափական պատկերը, որն ունի տարբեր տեսակներ՝ քառակուսի, սեղան, եռանկյուն ու շրջան։
//Իրանցից բոլորն ունեն գույն ու անուն (example - green, triangle) , որը տրվումա տվյալ պատկերը կառուցվելու ժամանակ, ու փոփոխման ենթակա չի, բայց պետքա հնարավոր լինի վերցնել և օգտագործել։
//Երկրաչափական բոլոր կոնկրետ պատկերները պետքա ունենան պարագիծ ու մակերես հաշվելու սեփական եղանակը։ Պարագիծը պետք լինի ամբողջ թիվ, իսկ մակերեսը՝ սահող ստորակետով թիվ։
//Եռանկյան դեպքում պետքա լինի հավելյալ ատրիբուտ, որը ցույց կտա, թե արդյոք եռանկյունը ուղղանկյուն եռանկյունա, թե ոչ։ Պյութագորասի թեորեմ օգատգործեք դա պարզելու համար։ Միանգամից ասեմ, որ ուղղանկյուն եռանկյունա թե ոչ, դա էնպիսի փրոփերթի չի, որ դրսից տաք, որովհետև դա որոշվելուա եռնակյան կողմերի հիման վրա։ Մնացածը դուք մտածեք, թե ոնց էդ փռոփերթին ինիթ անեք։ Դա նույնպես պետքա հնարավոր լինի վերցնել կլասից դուրս, բայց ոչ փոփոխել։
//Պետքա հնաարվոր լինի նշված բոլոր տեսսկի պատկերներին վերաբերել ընդհանուր, որպես երկրաչափաակն պատկեր, ու վերցնել իրանց պարագիծն ու մակերեսը՝ օգտագործելով dynamic polymprohism։
//Ունեցեք array, որի մեջ կլինեն տարբեր տեսակի պատկերներ։ Ծրագիրը պետքա պտտվի դրանց վրայով, որոշի դրանցից որի պարագիծնա մեծագույնը, ու վերջում տպի պարագիծն ու պատկերի անունը,
//Խնդիրը լուծելուց կլինեք ուշադիր, առանց հավելյալ բարդացումների։ Գծեք հիերարխիան՝ խնդիրն ու իրա կետերը կարդալու հետ զուգահեռ, հասկացեք որի մեջ ինչ պետքա սահմանեք, ալգորիթմը մշակեք, նոր լուծեք։
public class FigureGeometric {
    private final String color;
    private final String name;

    FigureGeometric(String name, String color) {
        this.color = color;
        this.name = name;
    }

    public double area() {
        return -1.0;
    }

    public int perimeter() {
        return -1;
    }

    public String getName() {
        return this.name;
    }

    public String getColor() {
        return this.color;
    }
}
